In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\Saathvik & Sujanya\Documents\Guvi\Project\04_Airbnb\airbnb.csv")

In [3]:
df.head().T

,0,1,2,3,4
_id,10006546,10009999,1001265,10021707,10030955
name,Ribeira Charming Duplex,Horto flat with small garden,Ocean View Waikiki Marina w/prkg,Private Room in Bushwick,Apt Linda Vista Lagoa - Rio
description,Fantastic duplex apartment with three bedrooms...,One bedroom + sofa-bed in quiet and bucolic ne...,A short distance from Honolulu's billion dolla...,Here exists a very cozy room for rent in a sha...,Quarto com vista para a Lagoa Rodrigo de Freit...
price,80.0,317.0,115.0,40.0,701.0
amenities,"['TV', 'Cable TV', 'Wifi', 'Kitchen', 'Paid pa...","['Wifi', 'Wheelchair accessible', 'Kitchen', '...","['TV', 'Cable TV', 'Wifi', 'Air conditioning',...","['Internet', 'Wifi', 'Air conditioning', 'Kitc...","['TV', 'Cable TV', 'Internet', 'Wifi', 'Air co..."
bedrooms,3.0,1.0,1.0,1.0,1.0
beds,5.0,2.0,1.0,1.0,1.0
cleaning_fee,35.0,187.0,100.0,0.0,250.0
guests_included,6,1,1,1,1
maximum_nights,30,1125,365,1125,1125
minimum_nights,2,2,3,14,1
number_of_reviews,51,0,96,1,0
property_type,House,Apartment,Condominium,Apartment,Apartment
room_type,Entire home/apt,Entire home/apt,Entire home/apt,Private room,Private room
availability,"{'availability_30': 28, 'availability_60': 47,...","{'availability_30': 0, 'availability_60': 0, '...","{'availability_30': 16, 'availability_60': 46,...","{'availability_30': 0, 'availability_60': 0, '...","{'availability_30': 28, 'availability_60': 58,..."
review_scores,89.0,0.0,84.0,100.0,0.0
host_id,51399391,1282196,5448114,11275734,51496939
host_name,Ana&Gonçalo,Ynaie,David,Josh,Livia
street,"Porto, Porto, Portugal","Rio de Janeiro, Rio de Janeiro, Brazil","Honolulu, HI, United States","Brooklyn, NY, United States","Rio de Janeiro, Rio de Janeiro, Brazil"
suburb,NaN,Jardim Botânico,Oʻahu,Brooklyn,Lagoa
government_area,"Cedofeita, Ildefonso, Sé, Miragaia, Nicolau, V...",Jardim Botânico,Primary Urban Center,Bushwick,Lagoa
market,Porto,Rio De Janeiro,Oahu,New York,Rio De Janeiro
country,Portugal,Brazil,United States,United States,Brazil
country_code,PT,BR,US,US,BR
location,"{'type': 'Point', 'coordinates': [-8.61308, 41...","{'type': 'Point', 'coordinates': [-43.23074991...","{'type': 'Point', 'coordinates': [-157.83919, ...","{'type': 'Point', 'coordinates': [-73.93615, 4...","{'type': 'Point', 'coordinates': [-43.20504708..."
availability_30,28,0,16,0,28
availability_60,47,0,46,0,58
availability_90,74,0,76,0,88
availability_365,239,0,343,0,363
latitude,41.1413,-22.966254,21.28634,40.69791,-22.971951
longitude,-8.61308,-43.23075,-157.83919,-73.93615,-43.205047

In [4]:
df.shape

(5545, 31)

In [5]:
df.describe()

,_id,price,bedrooms,beds,cleaning_fee,guests_included,maximum_nights,minimum_nights,number_of_reviews,review_scores,host_id,availability_30,availability_60,availability_90,availability_365,latitude,longitude
count,5.545000e+03,5545.000000,5545.000000,5545.000000,5545.000000,5545.000000,5.545000e+03,5545.000000,5545.00000,5545.000000,5.545000e+03,5545.000000,5545.000000,5545.000000,5545.000000,5545.000000,5545.000000
mean,1.664790e+07,278.541749,1.532552,2.078629,68.167538,1.747881,1.385268e+06,5.560325,27.56321,68.381605,6.514561e+07,11.809558,26.441839,42.744995,173.008296,22.081308,-6.694579
std,9.622412e+06,842.167507,0.964969,1.614314,102.842552,1.488504,5.261656e+07,22.629091,49.76575,41.834783,6.820153e+07,11.687110,23.478719,35.231075,139.837733,28.070424,90.488985
min,1.170800e+04,9.000000,1.000000,1.000000,0.000000,1.000000,1.000000e+00,1.000000,0.00000,0.000000,2.787000e+03,0.000000,0.000000,0.000000,0.000000,-34.088290,-159.678690
25%,8.386906e+06,70.000000,1.000000,1.000000,0.000000,1.000000,5.600000e+01,1.000000,1.00000,0.000000,1.023719e+07,0.000000,0.000000,0.000000,17.000000,20.725750,-73.599290
50%,1.711362e+07,129.000000,1.000000,2.000000,30.000000,1.000000,1.125000e+03,2.000000,5.00000,92.000000,3.725685e+07,8.000000,23.000000,43.000000,171.000000,40.727410,-8.611510
75%,2.461581e+07,281.000000,2.000000,3.000000,100.000000,2.000000,1.125000e+03,3.000000,32.00000,98.000000,1.047023e+08,24.000000,52.000000,80.000000,317.000000,41.163150,29.019250
max,3.295874e+07,48842.000000,20.000000,25.000000,2000.000000,16.000000,2.147484e+09,1250.000000,533.00000,100.000000,2.477517e+08,30.000000,60.000000,90.000000,365.000000,45.665630,151.338980

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5545 entries, 0 to 5544
Data columns (total 31 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   _id                5545 non-null   int64
 1   name               5537 non-null   object
 2   description        5450 non-null   object
 3   price              5545 non-null   float64
 4   amenities          5545 non-null   object
 5   bedrooms           5545 non-null   float64
 6   beds               5545 non-null   float64
 7   cleaning_fee       5545 non-null   float64
 8   guests_included    5545 non-null   int64
 9   maximum_nights     5545 non-null   int64
 10  minimum_nights     5545 non-null   int64
 11  number_of_reviews  5545 non-null   int64
 12  property_type      5545 non-null   object
 13  room_type          5545 non-null   object
 14  availability       5545 non-null   object
 15  review_scores      5545 non-null   float64
 16  host_id            5545 non-null   int64
 17  host_name          5545 non-null   object
 18  street             5545 non-null   object
 19  suburb             4660 non-null   object
 20  government_area    5545 non-null   object
 21  market             5539 non-null   object
 22  country            5545 non-null   object
 23  country_code       5545 non-null   object
 24  location           5545 non-null   object
 25  availability_30    5545 non-null   int64
 26  availability_60    5545 non-null   int64
 27  availability_90    5545 non-null   int64
 28  availability_365   5545 non-null   int64
 29  latitude           5545 non-null   float64
 30  longitude          5545 non-null   float64
dtypes: float64(7), int64(10), object(14)
memory usage: 1.3+ MB

In [7]:
df.country.unique()

array(['Portugal', 'Brazil', 'United States', 'Turkey', 'Canada',
       'Hong Kong', 'Spain', 'Australia', 'China'], dtype=object)

# Outliers- Portugal properties

In [103]:
df [ ( df['country'] == 'Portugal') & (df['property_type'] == 'Apartment') & (df['price'] > 200)]['price'].value_counts().reset_index()

   price  count
0  300.0      2
1  220.0      1
2  209.0      1
3  500.0      1

# Outliers- Brazil properties

In [25]:
df [ ( df['country'] == 'Brazil') & (df['property_type'] == 'Apartment') & (df['price'] > 3000)]['price'].value_counts().reset_index()

     price  count
0   3499.0      1
1  11190.0      1
2   6002.0      1
3   4498.0      1
4   4103.0      1
5   3544.0      1

In [27]:
df [ ( df['country'] == 'Brazil') & (df['property_type'] == 'House') & (df['price'] > 2500)]['price'].value_counts().reset_index()

    price  count
0  5595.0      2
1  2999.0      2
2  3726.0      1
3  5502.0      1
4  3730.0      1

In [28]:
df [ ( df['country'] == 'Brazil') & (df['property_type'] == 'Condominium') & (df['price'] > 2000)]['price'].value_counts().reset_index()

    price  count
0  3301.0      1
1  3544.0      1

In [29]:
df [ ( df['country'] == 'Brazil') & (df['property_type'] == 'Loft') & (df['price'] > 400)]['price'].value_counts().reset_index()

    price  count
0   560.0      1
1  2007.0      1

In [30]:
df [ ( df['country'] == 'Brazil') & (df['property_type'] == 'Serviced apartment') & (df['price'] > 1000)]['price'].value_counts().reset_index()

    price  count
0  3253.0      1

# Outliers- US properties

In [31]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'Condominium') & (df['price'] > 600)]['price'].value_counts().reset_index()

    price  count
0  1000.0      1
1   800.0      1
2   692.0      1
3   637.0      1
4   834.0      1

In [35]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'Apartment') & (df['price'] > 500)]['price'].value_counts().reset_index()

   price  count
0  550.0      1
1  555.0      1
2  725.0      1
3  560.0      1

In [36]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'House') & (df['price'] > 700)]['price'].value_counts().reset_index()

     price  count
0    795.0      1
1    895.0      1
2    935.0      1
3    799.0      1
4   1100.0      1
5   1500.0      1
6    750.0      1
7    800.0      1
8    776.0      1
9   2060.0      1
10   745.0      1
11  1295.0      1
12  3250.0      1
13  1000.0      1
14   890.0      1
15   850.0      1

In [38]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'Bungalow') & (df['price'] > 300)]['price'].value_counts().reset_index()

   price  count
0  469.0      1

In [40]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'Townhouse') & (df['price'] > 600)]['price'].value_counts().reset_index()

    price  count
0  2450.0      1

In [41]:
df [ ( df['country'] == 'United States') & (df['property_type'] == 'Cottage') & (df['price'] > 400)]['price'].value_counts().reset_index()

   price  count
0  500.0      1

# Outliers- Turkey properties

In [42]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'House') & (df['price'] > 550)]['price'].value_counts().reset_index()

    price  count
0   685.0      1
1  2636.0      1

In [45]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Apartment') & (df['price'] > 1200)]['price'].value_counts().reset_index()

     price  count
0  48842.0      1
1   4761.0      1
2   1698.0      1
3   1313.0      1

In [47]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Serviced apartment') & (df['price'] > 1000)]['price'].value_counts().reset_index()

    price  count
0  2974.0      1

In [49]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Bed and breakfast') & (df['price'] > 1200)]['price'].value_counts().reset_index()

    price  count
0  1213.0      1
1  2378.0      1
2  2083.0      1

In [50]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Loft') & (df['price'] > 500)]['price'].value_counts().reset_index()

   price  count
0  833.0      1

In [51]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Boutique hotel') & (df['price'] > 700)]['price'].value_counts().reset_index()

    price  count
0  1186.0      1
1   833.0      1
2   891.0      1

In [55]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Hotel') & (df['price'] > 1300)]['price'].value_counts().reset_index()

    price  count
0  7203.0      1
1  1550.0      1

In [56]:
df [ ( df['country'] == 'Turkey') & (df['property_type'] == 'Villa') & (df['price'] > 1500)]['price'].value_counts().reset_index()

    price  count
0  4745.0      1

# Outliers- Canada properties

In [61]:
df [ ( df['country'] == 'Canada') & (df['property_type'] == 'Apartment') & (df['price'] > 250)]['price'].value_counts().reset_index()

   price  count
0  301.0      3
1  600.0      2
2  400.0      2
3  270.0      1
4  576.0      1

In [62]:
df [ ( df['country'] == 'Canada') & (df['property_type'] == 'Condominium') & (df['price'] > 230)]['price'].value_counts().reset_index()

   price  count
0  250.0      1
1  325.0      1

In [63]:
df [ ( df['country'] == 'Canada') & (df['property_type'] == 'Loft') & (df['price'] > 400)]['price'].value_counts().reset_index()

    price  count
0  1200.0      1
1  1190.0      1

In [64]:
df [ ( df['country'] == 'Canada') & (df['property_type'] == 'House') & (df['price'] > 450)]['price'].value_counts().reset_index()

    price  count
0  1746.0      1

# Outliers- Hong Kong properties

In [65]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'Apartment') & (df['price'] > 2000)]['price'].value_counts().reset_index()

    price  count
0  2496.0      2
1  2748.0      1
2  2802.0      1
3  3399.0      1
4  2700.0      1

In [66]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'Condominium') & (df['price'] > 2400)]['price'].value_counts().reset_index()

     price  count
0  11681.0      1
1  10001.0      1

In [67]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'Bed and breakfast') & (df['price'] > 1600)]['price'].value_counts().reset_index()

     price  count
0  10001.0      1

In [68]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'Serviced apartment') & (df['price'] > 2300)]['price'].value_counts().reset_index()

     price  count
0   2661.0      1
1  11681.0      1

In [69]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'Hotel') & (df['price'] > 1000)]['price'].value_counts().reset_index()

    price  count
0  2002.0      1
1  2999.0      1

In [70]:
df [ ( df['country'] == 'Hong Kong') & (df['property_type'] == 'House') & (df['price'] > 1600)]['price'].value_counts().reset_index()

    price  count
0  4828.0      1
1  7002.0      1

# Outliers- Spain properties

In [79]:
df [ ( df['country'] == 'Spain') & (df['property_type'] == 'Apartment') & (df['price'] > 500)]['price'].value_counts().reset_index()

    price  count
0   550.0      2
1   600.0      2
2   527.0      1
3   805.0      1
4   750.0      1
5  2000.0      1
6   700.0      1
7   705.0      1

In [81]:
df [ ( df['country'] == 'Spain') & (df['property_type'] == 'Condominium') & (df['price'] > 220)]['price'].value_counts().reset_index()

   price  count
0  999.0      1

In [82]:
df [ ( df['country'] == 'Spain') & (df['property_type'] == 'Serviced apartment') & (df['price'] > 220)]['price'].value_counts().reset_index()

    price  count
0   599.0      2
1  1240.0      1

# Outliers- Australia properties

In [83]:
df [ ( df['country'] == 'Australia') & (df['property_type'] == 'Apartment') & (df['price'] > 500)]['price'].value_counts().reset_index()

   price  count
0  550.0      2
1  999.0      2
2  569.0      1
3  699.0      1
4  635.0      1
5  751.0      1
6  850.0      1
7  600.0      1

In [84]:
df [ ( df['country'] == 'Australia') & (df['property_type'] == 'House') & (df['price'] > 1000)]['price'].value_counts().reset_index()

    price  count
0  1105.0      1
1  2000.0      1
2  1200.0      1
3  1100.0      1
4  1321.0      1
5  1500.0      1

In [85]:
df [ ( df['country'] == 'Australia') & (df['property_type'] == 'Townhouse') & (df['price'] > 400)]['price'].value_counts().reset_index()

   price  count
0  600.0      1
1  451.0      1

In [86]:
df [ ( df['country'] == 'Australia') & (df['property_type'] == 'Serviced apartment') & (df['price'] > 250)]['price'].value_counts().reset_index()

   price  count
0  350.0      1

In [88]:
df [ ( df['country'] == 'Australia') & (df['property_type'] == 'Villa') & (df['price'] > 150)]['price'].value_counts().reset_index()

    price  count
0  2356.0      1

# Removing Ouliers -Portugal

In [6]:
df.shape

(5545, 31)

In [8]:
df1 = df.drop(df [ ( df['country'] == 'Portugal') & (df['property_type'] == 'Apartment') & (df['price'] > 200)].index).reset_index(drop=True)

In [9]:
df1.shape

(5540, 31)

# Removing Ouliers -Brazil

In [10]:
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'Apartment') & (df1['price'] > 3000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'House') & (df1['price'] > 2500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'Bed and breakfast') & (df1['price'] > 300)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'Condominium') & (df1['price'] > 2000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'Loft') & (df1['price'] > 400)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Brazil') & (df1['property_type'] == 'Serviced apartment') & (df1['price'] > 1000)].index,inplace=True)

In [11]:
df1.shape

(5521, 31)

# Removing Ouliers -United States

In [12]:
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'Condominium') & (df1['price'] > 600)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'Apartment') & (df1['price'] > 500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'House') & (df1['price'] > 700)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'Bungalow') & (df1['price'] > 300)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'Townhouse') & (df1['price'] > 500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'United States') & (df1['property_type'] == 'Cottage') & (df1['price'] > 500)].index,inplace=True)

In [13]:
df1.shape

(5493, 31)

# Removing Ouliers -Turkey

In [14]:
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'House') & (df1['price'] > 550)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Apartment') & (df1['price'] > 1200)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Serviced apartment') & (df1['price'] > 1000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Bed and breakfast') & (df1['price'] > 1200)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Loft') & (df1['price'] > 500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Boutique hotel') & (df1['price'] > 600)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Hotel') & (df1['price'] > 1000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Turkey') & (df1['property_type'] == 'Villa') & (df1['price'] > 1500)].index,inplace=True)

In [15]:
df1.shape

(5476, 31)

# Removing Ouliers -Canada

In [16]:
df1.drop(df1 [ ( df1['country'] == 'Canada') & (df1['property_type'] == 'Apartment') & (df1['price'] > 250)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Canada') & (df1['property_type'] == 'Condominium') & (df1['price'] > 230)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Canada') & (df1['property_type'] == 'Loft') & (df1['price'] > 400)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Canada') & (df1['property_type'] == 'House') & (df1['price'] > 450)].index,inplace=True)

In [17]:
df1.shape

(5462, 31)

# Removing Ouliers - Hong Kong

In [18]:
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'Apartment') & (df1['price'] > 2000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'Condominium') & (df1['price'] > 2400)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'Bed and breakfast') & (df1['price'] > 1600)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'Serviced apartment') & (df1['price'] > 2000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'Hotel') & (df1['price'] > 1000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Hong Kong') & (df1['property_type'] == 'House') & (df1['price'] > 1600)].index,inplace=True)

In [19]:
df1.shape

(5446, 31)

# Removing Ouliers - Spain

In [20]:
df1.drop(df1 [ ( df1['country'] == 'Spain') & (df1['property_type'] == 'Apartment') & (df1['price'] > 500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Spain') & (df1['property_type'] == 'Condominium') & (df1['price'] > 220)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Spain') & (df1['property_type'] == 'Serviced apartment') & (df1['price'] > 220)].index,inplace=True)

In [21]:
df1.shape

(5432, 31)

# Removing Ouliers - Australia

In [22]:
df1.drop(df1 [ ( df1['country'] == 'Australia') & (df1['property_type'] == 'Apartment') & (df1['price'] > 500)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Australia') & (df1['property_type'] == 'House') & (df1['price'] > 1000)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Australia') & (df1['property_type'] == 'Townhouse') & (df1['price'] > 400)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Australia') & (df1['property_type'] == 'Serviced apartment') & (df1['price'] > 250)].index,inplace=True)
df1.drop(df1 [ ( df1['country'] == 'Australia') & (df1['property_type'] == 'Villa') & (df1['price'] > 150)].index,inplace=True)

In [23]:
df1.shape

(5412, 31)

In [25]:
df1.to_csv(r"C:\Users\Saathvik & Sujanya\Documents\Guvi\Project\04_Airbnb\airbnb_without_outlier.csv", index=False)